Readit/Readdit/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "something"], ["sub_id", 1], ["user_id", 4], ["created_at", "2019-07-09 20:11:26.436551"], ["updated_at", "2019-07-09 20:11:26.436551"]]