Readit/Readdit/app/controllers/subs_controller.rb

  def update
    @sub = current_user.subs.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]